Importing all necessary modules

In [1]:
try:
    import pandas as pd
    import numpy as np
    import matplotlib.pyplot as plt   
    # import time
    # import sys
    print("all modules imported succesfully")
except Exception as e:
    print(e)
    exit()

all modules imported succesfully

# Pandas Tutorial Code

### Creating Series

Using List

In [2]:
list1 = [_ for _ in range(11,66,11)]
ser_form_list1 = pd.Series(list1)
ser_form_list1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [3]:
list2 = [11,22,"priyang",44,1.33]
ser_form_list2 = pd.Series(list2)
ser_form_list2

0         11
1         22
2    priyang
3         44
4       1.33
dtype: object

Using Tuple

In [4]:
tuple1 = (_ for _ in range(11,66,11))
ser_form_tuple1 = pd.Series(tuple1)
ser_form_tuple1

0    11
1    22
2    33
3    44
4    55
dtype: int64

Using Dictionary

In [5]:
dict1 = {i-1:11*i for i in range(1,6)}
ser_form_dict1 = pd.Series(dict1)
ser_form_dict1

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [6]:
dict2 = {1:11,3:22,5:22,7:33,10:44,12:55}
ser_form_dict2 = pd.Series(dict2)
ser_form_dict2

1     11
3     22
5     22
7     33
10    44
12    55
dtype: int64

Using Numpy Array

In [7]:
numpy_arr1 = np.arange(11,66,11)
ser_form_numpy_arr1 = pd.Series(numpy_arr1)
ser_form_numpy_arr1

0    11
1    22
2    33
3    44
4    55
dtype: int32

Using Scalar Value

In [8]:
scalar_value = 11
ser_form_scalar_value = pd.Series(scalar_value,index=[_ for _ in range(6)])
ser_form_scalar_value

0    11
1    11
2    11
3    11
4    11
5    11
dtype: int64

### Series with custom index

In [9]:
ser_form_list1_cus_idx = pd.Series(list1,index=[chr(97+i) for i in range(5)],dtype=float)
ser_form_list1_cus_idx

a    11.0
b    22.0
c    33.0
d    44.0
e    55.0
dtype: float64

### Accessing Values via Slicing

In [10]:
ser_form_list1[0]

11

In [11]:
ser_form_list1[0:2]

0    11
1    22
dtype: int64

### Operation on Pandas Series

In [12]:
op_s1 = pd.Series([i for i in range(1,6)])
op_s2 = pd.Series([10*i for i in range(1,6)])

In [13]:
op_s1+op_s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [14]:
op_s1-op_s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [15]:
op_s1*op_s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [16]:
op_s1/op_s2

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [17]:
(op_s1+op_s2)**2

0     121
1     484
2    1089
3    1936
4    3025
dtype: int64

If 2 Series have unequal number of element then<br/>
remaining elements will give nan on operations

In [18]:
op_s1+op_s2[:op_s2.size-1]

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

### Creating DataFrame

Using List

In [19]:
df_from_list1 = pd.DataFrame([_ for _ in range(11,66,11)])
df_from_list1

    0
0  11
1  22
2  33
3  44
4  55

Using Nested List

In [20]:
df_from_list2 = pd.DataFrame([["Priyang",98],["Vedant",89],["Parshav",88]])
df_from_list2

         0   1
0  Priyang  98
1   Vedant  89
2  Parshav  88

Using Dictionary

In [21]:
dict2 = {"Name":["Priyang","Aadhaya","krishna"],"Marks":[98,89,99]}
df_from_dict = pd.DataFrame(dict2)
df_from_dict

      Name  Marks
0  Priyang     98
1  Aadhaya     89
2  krishna     99

Using Numpy Array

In [22]:
arr_for_df =  np.arange(1,10).reshape(3,-1)
df_from_np_array = pd.DataFrame(arr_for_df,
                columns=[chr(i+97) for i in range(arr_for_df.shape[1])], ## cols
                index=[i for i in range(arr_for_df.shape[0])]) ## no of rows
df_from_np_array

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

Using Series

In [23]:
dict3 = {
    'First':pd.Series([chr(97+i) for i in range(4)]),
    'Second':pd.Series([chr(ord('w')+i) for i in range(4)])
}

df_from_series = pd.DataFrame(dict3)
df_from_series

  First Second
0     a      w
1     b      x
2     c      y
3     d      z

### Dataframe with Custom Index

In [24]:
df_cus_idx = pd.DataFrame(dict2,index=["stu"+str(i) for i in range(1,4)])
df_cus_idx

         Name  Marks
stu1  Priyang     98
stu2  Aadhaya     89
stu3  krishna     99

In [25]:
list3 = [["Priyang",98],["Vedant",89],["Parshav",88]]

df_cus_via_nes_lst = pd.DataFrame(list3,
                    columns=["Name","Marks"],
                    index=[11*(i+1) for i in range(len(list3))]) 
df_cus_via_nes_lst

       Name  Marks
11  Priyang     98
22   Vedant     89
33  Parshav     88

QUESTION SET1

In [26]:
list4 = [["Ahmeddabad",40.1],["Anand",35.2],["Baroda",38.5]]
pd.DataFrame(list4,columns=["City","Temp"],index=[1,2,3])

         City  Temp
1  Ahmeddabad  40.1
2       Anand  35.2
3      Baroda  38.5

### Attributes of Pandas Dataframe

In [27]:
dict_for_df1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
               }
df_from_dict1=pd.DataFrame(dict_for_df1,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict1

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [28]:
df_from_dict1.shape

(7, 2)

In [29]:
df_from_dict1.head(2)

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89

In [30]:
df_from_dict1.tail(2)

         Name  Marks
stu6   Mittal     83
stu7  Archana     82

In [31]:
df_from_dict1.columns

Index(['Name', 'Marks'], dtype='object')

In [32]:
df_from_dict1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, stu1 to stu7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
dtypes: int64(1), object(1)
memory usage: 168.0+ bytes

In [33]:
df_from_dict1['Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [34]:
df_from_dict1.Name

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
stu5     Parshv
stu6     Mittal
stu7    Archana
Name: Name, dtype: object

In [35]:
df_from_dict1[['Name','Marks']]

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89
stu3   Krisha     99
stu4   Vedant     87
stu5   Parshv     90
stu6   Mittal     83
stu7  Archana     82

In [36]:
df_from_dict1['Marks'].min()

82

In [37]:
df_from_dict1['Marks'].max()

99

In [38]:
df_from_dict1['Marks'].mean()

89.71428571428571

In [39]:
df_from_dict1.describe()

           Marks
count   7.000000
mean   89.714286
std     6.676184
min    82.000000
25%    85.000000
50%    89.000000
75%    94.000000
max    99.000000

In [40]:
df_from_dict1['Marks'].value_counts()

Marks
98    1
89    1
99    1
87    1
90    1
83    1
82    1
Name: count, dtype: int64

In [41]:
dict_for_df2 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[99,89,99,87,99,87,82],
               }
df_from_dict2=pd.DataFrame(dict_for_df2,index=['stu1','stu2','stu3','stu4','stu5','stu6','stu7'])

df_from_dict2["Marks"].value_counts()

Marks
99    3
87    2
89    1
82    1
Name: count, dtype: int64

In [42]:
df_from_dict2.count()

Name     7
Marks    7
dtype: int64

In [43]:
df_from_dict2['Marks'].count()

7

### Lov vs Iloc

loc[rows i want,cloumns i want]

In [44]:
dict_for_df3 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82],
                'Grades':["AA","AB","AA","AB","AC","BA","BB"],
               }
df_from_dict3=pd.DataFrame(dict_for_df3)
df_from_dict3

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [45]:
df_from_dict3.loc[0,:]

Name      Priyang
Marks          98
Grades         AA
Name: 0, dtype: object

In [46]:
df_from_dict3.loc[[0,1,2],:],df_from_dict3.loc[0:2,:],

(      Name  Marks Grades
 0  Priyang     98     AA
 1   Aadhya     89     AB
 2   Krisha     99     AA,
       Name  Marks Grades
 0  Priyang     98     AA
 1   Aadhya     89     AB
 2   Krisha     99     AA)

In [47]:
df_from_dict3.loc[:,"Name"]

0    Priyang
1     Aadhya
2     Krisha
3     Vedant
4     Parshv
5     Mittal
6    Archana
Name: Name, dtype: object

In [48]:
df_from_dict3.loc[:,['Name','Marks']]

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [49]:
df_from_dict3.loc[:,'Name':]

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [50]:
df_from_dict3.loc[:,'Marks':]

   Marks Grades
0     98     AA
1     89     AB
2     99     AA
3     87     AB
4     90     AC
5     83     BA
6     82     BB

iloc[First Inclusive,Last Exclusive] access by integer positions

In [51]:
df_from_dict3.iloc[:,0]

0    Priyang
1     Aadhya
2     Krisha
3     Vedant
4     Parshv
5     Mittal
6    Archana
Name: Name, dtype: object

In [52]:
df_from_dict3.iloc[:,0:2]

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [53]:
df_from_dict3.index = ['stu'+str(i) for i in range(1,df_from_dict3.shape[0]+1)]
df_from_dict3

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

Question Set 2

In [54]:
df_from_dict3.loc[['stu1','stu2'],:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [55]:
df_from_dict3.loc['stu1':'stu4','Name']

stu1    Priyang
stu2     Aadhya
stu3     Krisha
stu4     Vedant
Name: Name, dtype: object

In [56]:
df_from_dict3.iloc[:2,:2]

         Name  Marks
stu1  Priyang     98
stu2   Aadhya     89

In [57]:
df_from_dict3.iloc[:3,:3]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA

BY loc

In [58]:
df_from_dict3.loc[:'stu2',:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [59]:
df_from_dict3.loc[['stu'+str(i) for i in range(1,7,2)],['Name','Grades']]

         Name Grades
stu1  Priyang     AA
stu3   Krisha     AA
stu5   Parshv     AC

In [60]:
df_from_dict3.loc[:'stu7',:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

By iloc

In [61]:
df_from_dict3.iloc[:2,:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB

In [62]:
df_from_dict3.iloc[0:5:2,0:3:2]

         Name Grades
stu1  Priyang     AA
stu3   Krisha     AA
stu5   Parshv     AC

In [63]:
df_from_dict3.iloc[[0,2,4],[0,1]]

         Name  Marks
stu1  Priyang     98
stu3   Krisha     99
stu5   Parshv     90

In [64]:
df_from_dict3.iloc[0:7,:]

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

### at vs iat

iat

In [65]:
df_from_dict3.iat[1,2]

'AB'

In [66]:
df_from_dict3.iat[4,1] = 99
df_from_dict3

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     99     AC
stu6   Mittal     83     BA
stu7  Archana     82     BB

at

In [67]:
df_from_dict3.at['stu2','Grades']

'AB'

In [68]:
df_from_dict3.at['stu5','Name']

'Parshv'

In [69]:
df_from_dict3.at['stu5','Marks'] = 99
df_from_dict3.at['stu5','Marks']

99

Reseting stu5 marks for  further code nothing else

In [70]:
df_from_dict3.at['stu5','Marks'] = 90

### Accessing values with Boolean Array

In [71]:
dict_for_df4 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv'],
                'Marks':[98,89,99,87,90],
                'Grades':["AA","AB","AA","AB","AC"],
               }
df_from_dict4=pd.DataFrame(dict_for_df4)
df_from_dict4.index = ['stu'+str(i) for i in range(1,df_from_dict4.shape[0]+1)]
df_from_dict4

         Name  Marks Grades
stu1  Priyang     98     AA
stu2   Aadhya     89     AB
stu3   Krisha     99     AA
stu4   Vedant     87     AB
stu5   Parshv     90     AC

In [72]:
df_from_dict4.loc[[True,False,True,False,True]]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA
stu5   Parshv     90     AC

In [73]:
df_from_dict4.loc[[False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [74]:
df_from_dict4.loc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC

In [75]:
df_from_dict4.loc[[False,False,False,True,False],[False,True,False]]

      Marks
stu4     87

Iloc works same as loc when boolean passed

In [76]:
df_from_dict4.iloc[[True,False,True,False,True]]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA
stu5   Parshv     90     AC

In [77]:
df_from_dict4.iloc[[False,False,False,False,False],[False,False,False]]

Empty DataFrame
Columns: []
Index: []

In [78]:
df_from_dict4.iloc[[True,False,False,False,True],[False,False,True]]

     Grades
stu1     AA
stu5     AC

In [79]:
df_from_dict4.iloc[[False,False,False,True,False],[False,True,False]]

      Marks
stu4     87

### Conditional Selection on Dataframe

In [80]:
c1=df_from_dict3['Marks'] > 90

In [81]:
df_from_dict3[c1]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [82]:
c2 = df_from_dict3['Grades']=='AB'
df_from_dict3[c2]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [83]:
c3 = (df_from_dict3['Grades']=='AB') & (df_from_dict3['Marks']>80)
df_from_dict3[c3]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [84]:
c4 = df_from_dict3['Marks']>90
df_from_dict3['Name'][c4]

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

In [85]:
df_from_dict3[c4]['Name']
# both are same this and above one

stu1    Priyang
stu3     Krisha
Name: Name, dtype: object

In [86]:
c5 = df_from_dict3['Grades']=="AB"
df_from_dict3['Name'][c5]

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

By loc

In [87]:
c6 = df_from_dict3['Marks']>90
df_from_dict3.loc[c6]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [88]:
c7 = (df_from_dict3['Marks']>80)&(df_from_dict3['Grades']=="AB")
df_from_dict3.loc[c7]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

By iloc

In [89]:
df_from_dict3[df_from_dict3.iloc[:,1]>90]

         Name  Marks Grades
stu1  Priyang     98     AA
stu3   Krisha     99     AA

In [90]:
df_from_dict3[(df_from_dict3.iloc[:,1]>80) & (df_from_dict3.iloc[:,2]=="AB")]

        Name  Marks Grades
stu2  Aadhya     89     AB
stu4  Vedant     87     AB

In [91]:
df_from_dict3[(df_from_dict3.iloc[:,2]=="AB")]['Name']

stu2    Aadhya
stu4    Vedant
Name: Name, dtype: object

In [92]:
df_from_dict1.index = [i for i in range(df_from_dict1.shape[0])]
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

### Add or Remove Column in Dataframe

Python List

In [93]:
df_add_li = ["AA","AB","AA","AB","AC","BA","BB"]
df_from_dict1['Grades1'] = df_add_li
df_from_dict1

      Name  Marks Grades1
0  Priyang     98      AA
1   Aadhya     89      AB
2   Krisha     99      AA
3   Vedant     87      AB
4   Parshv     90      AC
5   Mittal     83      BA
6  Archana     82      BB

Removing a column

In [94]:
# df_from_dict1.drop(columns='Grades1',axis=0,inplace=True)  
df_from_dict1.drop(columns='Grades1',inplace=True)  
## axis = 1 for column
## inplace = True to remove it permanently

In [95]:
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [96]:
ser_for_df = pd.Series(["AA","AB","AA","AB","AC","BA","BB"])
dict_for_df5 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82]}
      
df_from_dict5 = pd.DataFrame(dict_for_df5)
df_from_dict5

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

In [97]:
df_from_dict5['Grades2'] = ser_for_df
df_from_dict5

      Name  Marks Grades2
0  Priyang     98      AA
1   Aadhya     89      AB
2   Krisha     99      AA
3   Vedant     87      AB
4   Parshv     90      AC
5   Mittal     83      BA
6  Archana     82      BB

In [98]:
city_dict={'Anand':'Priyang','Ahmedabad':'Addhya',
   'Nadiad':'Krisha','Baroda':'Vedant',
   'khambhat':'Parshv',
   'Khambhat':'Mittal','Ahmedabad1':'Archana'}
df_from_dict5['City'] = city_dict
df_from_dict5 
# city_dict

      Name  Marks Grades2 City
0  Priyang     98      AA  NaN
1   Aadhya     89      AB  NaN
2   Krisha     99      AA  NaN
3   Vedant     87      AB  NaN
4   Parshv     90      AC  NaN
5   Mittal     83      BA  NaN
6  Archana     82      BB  NaN

In [99]:
df_from_dict5

      Name  Marks Grades2 City
0  Priyang     98      AA  NaN
1   Aadhya     89      AB  NaN
2   Krisha     99      AA  NaN
3   Vedant     87      AB  NaN
4   Parshv     90      AC  NaN
5   Mittal     83      BA  NaN
6  Archana     82      BB  NaN

In [100]:
dict_for_df6 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,82]}
df_from_dict6 = pd.DataFrame(dict_for_df6)
df_from_dict6.insert(1,'grades3',ser_for_df)
df_from_dict6['name_grade'] = df_from_dict6['Name']+" "+df_from_dict6['grades3']

df_from_dict6

      Name grades3  Marks  name_grade
0  Priyang      AA     98  Priyang AA
1   Aadhya      AB     89   Aadhya AB
2   Krisha      AA     99   Krisha AA
3   Vedant      AB     87   Vedant AB
4   Parshv      AC     90   Parshv AC
5   Mittal      BA     83   Mittal BA
6  Archana      BB     82  Archana BB

In [101]:
ser_for_df1 = [11*i for i in range(len(ser_for_df))]
df_from_df = df_from_dict6.assign(Grades4 = ser_for_df,temp=ser_for_df1)
df_from_df

      Name grades3  Marks  name_grade Grades4  temp
0  Priyang      AA     98  Priyang AA      AA     0
1   Aadhya      AB     89   Aadhya AB      AB    11
2   Krisha      AA     99   Krisha AA      AA    22
3   Vedant      AB     87   Vedant AB      AB    33
4   Parshv      AC     90   Parshv AC      AC    44
5   Mittal      BA     83   Mittal BA      BA    55
6  Archana      BB     82  Archana BB      BB    66

In [102]:
df_from_df.assign(marks1=lambda x:x['Marks']+1)
#### or 
df_from_df.assign(marks1=df_from_df['Marks']+1)

      Name grades3  Marks  name_grade Grades4  temp  marks1
0  Priyang      AA     98  Priyang AA      AA     0      99
1   Aadhya      AB     89   Aadhya AB      AB    11      90
2   Krisha      AA     99   Krisha AA      AA    22     100
3   Vedant      AB     87   Vedant AB      AB    33      88
4   Parshv      AC     90   Parshv AC      AC    44      91
5   Mittal      BA     83   Mittal BA      BA    55      84
6  Archana      BB     82  Archana BB      BB    66      83

### Add or remove rows from dataframe

In [103]:
df_from_dict1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82

Using concat

In [104]:
df_for_concat1 = pd.DataFrame({'Name':'Anil','Marks':[99]})
concated_df1 = pd.concat([df_from_dict1,df_for_concat1],ignore_index=True)
concated_df1

      Name  Marks
0  Priyang     98
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

Using iloc

In [105]:
concated_df1.iloc[0] = ['Rnil',89]
concated_df1

      Name  Marks
0     Rnil     89
1   Aadhya     89
2   Krisha     99
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

Using iloc

In [106]:
concated_df1.loc[2] = ['Jil',79]
concated_df1

      Name  Marks
0     Rnil     89
1   Aadhya     89
2      Jil     79
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

In [107]:
concated_df1.drop([0,2],inplace=True)
concated_df1.reset_index(drop=True)
concated_df1

      Name  Marks
1   Aadhya     89
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

In [108]:
c8 = concated_df1[concated_df1['Marks']<90]
concated_df1.drop(c8.index)

     Name  Marks
4  Parshv     90
7    Anil     99

In [109]:
concated_df1

      Name  Marks
1   Aadhya     89
3   Vedant     87
4   Parshv     90
5   Mittal     83
6  Archana     82
7     Anil     99

### create csv file

In [110]:
df_from_dict3.index = [i for i in range(df_from_dict3.shape[0])]
df_from_dict3

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [111]:
df_from_dict3.to_csv('csv_df.csv')

In [112]:
df_from_csv = pd.read_csv('csv_df.csv')
df_from_csv.drop(columns='Unnamed: 0',inplace=True)
df_from_csv

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

Read csv

In [113]:
marks_csv = 'Datasets/DS/marks.csv'
data_from_csv = pd.read_csv(marks_csv)
data_from_csv

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

Read Excel

In [114]:
try:
    data_from_excel = pd.read_excel('Datasets//DS//excel_file.xlsx',sheet_name=1)
    print(data_from_excel)
except Exception as e:
    print(e)

   Unnamed: 0    a     b     c      d message
0           0  100   200   300   4000   hello
1           1  200   600   700   8000     how
2           2  300  1000  1000  12000     are
3           3  400  3000  2000   1300     you

Read table

In [115]:
data_from_table = pd.read_table('Datasets//DS//Restaurant_Reviews.tsv')
data_from_table

                                                Review  Liked
0                             Wow... Loved this place.      1
1                                   Crust is not good.      0
2            Not tasty and the texture was just nasty.      0
3    Stopped by during the late May bank holiday of...      1
4    The selection on the menu was great and so wer...      1
..                                                 ...    ...
995  I think food should have flavor and texture an...      0
996                           Appetite instantly gone.      0
997  Overall I was not impressed and would not go b...      0
998  The whole experience was underwhelming, and I ...      0
999  Then, as if I hadn't wasted enough of my life ...      0

[1000 rows x 2 columns]

Skip top rows

In [116]:
data_from_csv1 = pd.read_csv(marks_csv,skiprows=2)
data_from_csv1

    Aadhya  89  AB
0   Krisha  99  AA
1   Vedant  87  AB
2   Parshv  90  AC
3   Mittal  83  BA
4  Archana  82  BB

In [117]:
data_from_csv2 = pd.read_csv(marks_csv,skiprows=[i for i in range(1,3)])
data_from_csv2

      Name  Marks Grades
0   Krisha     99     AA
1   Vedant     87     AB
2   Parshv     90     AC
3   Mittal     83     BA
4  Archana     82     BB

In [118]:
def function(x: int) -> bool:
    return x%3==0
    # if x%3==0:
    #     return True

In [119]:
data_from_csv3 = pd.read_csv(marks_csv,skiprows=lambda x:function(x))
data_from_csv3

   Priyang  98  AA
0   Aadhya  89  AB
1   Vedant  87  AB
2   Parshv  90  AC
3  Archana  82  BB

Skip end rows

In [120]:
data_from_csv4 = pd.read_csv(marks_csv,skipfooter=3,engine='python')
data_from_csv4

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB

reading only starting n rows

In [121]:
data_from_csv5 = pd.read_csv(marks_csv,nrows=2)
data_from_csv5

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB

reading only selected cols

In [122]:
data_from_csv6 = pd.read_csv(marks_csv,usecols=[0,2])
data_from_csv6

      Name Grades
0  Priyang     AA
1   Aadhya     AB
2   Krisha     AA
3   Vedant     AB
4   Parshv     AC
5   Mittal     BA
6  Archana     BB

In [123]:
data_from_csv7 = pd.read_csv(marks_csv,usecols=['Name','Grades'])
data_from_csv7

      Name Grades
0  Priyang     AA
1   Aadhya     AB
2   Krisha     AA
3   Vedant     AB
4   Parshv     AC
5   Mittal     BA
6  Archana     BB

In [124]:
data_from_csv8 = pd.read_csv('Datasets/DS/marks_new.csv',usecols=lambda x:x.upper() in ['AAA','BBB','CCC'])
data_from_csv8

       AAA  BBB CCC
0  Priyang   98  AA
1   Aadhya   89  AB
2   Krisha   99  AA
3   Vedant   87  AB
4   Parshv   90  AC
5   Mittal   83  BA
6  Archana   82  BB

Making index of column

In [125]:
data_from_csv8 = pd.read_csv(marks_csv,index_col=[1])
data_from_csv8

          Name Grades
Marks
98     Priyang     AA
89      Aadhya     AB
99      Krisha     AA
87      Vedant     AB
90      Parshv     AC
83      Mittal     BA
82     Archana     BB

In [126]:
data_from_csv9 = pd.read_csv(marks_csv,index_col=['Grades'])
data_from_csv9

           Name  Marks
Grades
AA      Priyang     98
AB       Aadhya     89
AA       Krisha     99
AB       Vedant     87
AC       Parshv     90
BA       Mittal     83
BB      Archana     82

set index

In [127]:
data_from_csv10 = pd.read_csv(marks_csv)
data_from_csv10.set_index('Marks')

          Name Grades
Marks
98     Priyang     AA
89      Aadhya     AB
99      Krisha     AA
87      Vedant     AB
90      Parshv     AC
83      Mittal     BA
82     Archana     BB

reset the index

In [128]:
data_from_csv10.reset_index()

   index     Name  Marks Grades
0      0  Priyang     98     AA
1      1   Aadhya     89     AB
2      2   Krisha     99     AA
3      3   Vedant     87     AB
4      4   Parshv     90     AC
5      5   Mittal     83     BA
6      6  Archana     82     BB

In [129]:
data_from_csv11 = pd.read_csv('Datasets/DS/marks_2nh.csv',header=None)
data_from_csv11

         0   1   2
0  Priyang  98  AA
1   Aadhya  89  AB
2   Krisha  99  AA
3   Vedant  87  AB
4   Parshv  90  AC
5   Mittal  83  BA
6  Archana  82  BB

In [130]:
data_from_csv12 = pd.read_csv('Datasets/DS/marks_2nh.csv',names=[1.1,2.1,3.2])
data_from_csv12

       1.1  2.1 3.2
0  Priyang   98  AA
1   Aadhya   89  AB
2   Krisha   99  AA
3   Vedant   87  AB
4   Parshv   90  AC
5   Mittal   83  BA
6  Archana   82  BB

In [131]:
data_from_csv12 = pd.read_csv('Datasets/DS/marks_2nh.csv',names=["AA","BB","CC","DD"])
data_from_csv12

        AA  BB  CC  DD
0  Priyang  98  AA NaN
1   Aadhya  89  AB NaN
2   Krisha  99  AA NaN
3   Vedant  87  AB NaN
4   Parshv  90  AC NaN
5   Mittal  83  BA NaN
6  Archana  82  BB NaN

In [132]:
data_from_csv13 = pd.read_csv('Datasets/DS/marks_2nh.csv',names=["Name","Marks","Grades"])
data_from_csv13

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

In [133]:
data_from_csv14 = pd.read_csv(marks_csv,names=["aa","bb","cc"],header=0)
data_from_csv14

        aa  bb  cc
0  Priyang  98  AA
1   Aadhya  89  AB
2   Krisha  99  AA
3   Vedant  87  AB
4   Parshv  90  AC
5   Mittal  83  BA
6  Archana  82  BB

prefix

if prefix is not none then header = none

In [134]:
data_from_csv15 = pd.read_csv('Datasets/DS/marks_2nh.csv',header=None)
data_from_csv15.add_prefix('x')

        x0  x1  x2
0  Priyang  98  AA
1   Aadhya  89  AB
2   Krisha  99  AA
3   Vedant  87  AB
4   Parshv  90  AC
5   Mittal  83  BA
6  Archana  82  BB

Dtype

In [135]:
data_from_csv16 = pd.read_csv('Datasets/DS/marks_new.csv',dtype={'BBB':'float32','EEE':'float64'},header=0)
data_from_csv16

       AAA   BBB CCC  DDD   EEE
0  Priyang  98.0  AA    1  11.0
1   Aadhya  89.0  AB    2  12.0
2   Krisha  99.0  AA    3  13.0
3   Vedant  87.0  AB    4  14.0
4   Parshv  90.0  AC    5  15.0
5   Mittal  83.0  BA    6  15.0
6  Archana  82.0  BB    7  17.0

True false

In [136]:
data_from_csv16 = pd.read_csv('Datasets/DS/marks_a.csv',true_values=['Yes'],false_values=['No','Not'])
data_from_csv16.drop(columns='Unnamed: 0',inplace=True)
data_from_csv16
# data_from_csv16['Attend'] = ['Yes' for _ in range(data_from_csv16.shape[0])]
# data_from_csv16.at[2,'Attend']='Not'
# data_from_csv16.at[4,'Attend']='No'
# data_from_csv16.at[6,'Attend']='No'
# data_from_csv16.to_csv('Datasets/DS/marks_a.csv')

      Name  Marks Grades  Attend
0  Priyang     98     AA    True
1   Aadhya     89     AB    True
2   Krisha     99     AA   False
3   Vedant     87     AB    True
4   Parshv     90     AC   False
5   Mittal     83     BA    True
6  Archana     82     BB   False

In [137]:
len(data_from_csv16)-data_from_csv16['Attend'].sum()

3

Squeeze is now discontinued

squeeze returns series insted of df if no of col is 1

In [138]:
# data_from_csv17 = pd.read_csv(marks_csv,usecols=['Name'],squeeze=True)
#

In [139]:
# type(data_from_csv17)

ChunkSize

In [140]:
large_data_from_csv = pd.read_csv('Datasets/DS/iris_code.csv',chunksize=10)

In [141]:
t_len=0
for chunk in large_data_from_csv:
    t_len+=len(chunk)
    # print(chunk)
print(f'length of iris dataset is {t_len}')

length of iris dataset is 150

Concat chunks

In [142]:
large_data_from_csv = pd.read_csv('Datasets/DS/iris_code.csv',chunksize=10)
concat_ch = pd.concat(large_data_from_csv,ignore_index=True)
concat_ch

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

inplace

if inplace true then return nothing and operation is permanenet on df<br/>
else it will return copy of df with oper aplied and no oper on orig df

In [143]:
data_from_csv18 = pd.read_csv('Datasets/DS/marks_a.csv')
data_from_csv18.drop(columns=['Unnamed: 0','Grades'],inplace=True)
data_from_csv18

      Name  Marks Attend
0  Priyang     98    Yes
1   Aadhya     89    Yes
2   Krisha     99    Not
3   Vedant     87    Yes
4   Parshv     90     No
5   Mittal     83    Yes
6  Archana     82     No

### null data

In [144]:
data_from_csv19 = pd.read_csv('Datasets/DS/data_#na.csv')
data_from_csv19.isnull().sum(axis=0),data_from_csv19.isnull().sum(axis=1)

(Unnamed: 0    0
 Name          0
 Marks         2
 Grades        2
 dtype: int64,
 0    1
 1    1
 2    0
 3    1
 4    0
 5    1
 6    0
 dtype: int64)

In [145]:
data_from_csv19.isnull().sum()

Unnamed: 0    0
Name          0
Marks         2
Grades        2
dtype: int64

In [146]:
data_from_csv19.isnull().sum().sum()

4

isnull == isna<br/>
just diff name

In [147]:
data_from_csv19.isnull().sum().sum()

4

### Not null

In [148]:
data_from_csv19.notnull()

   Unnamed: 0  Name  Marks  Grades
0        True  True   True   False
1        True  True  False    True
2        True  True   True    True
3        True  True   True   False
4        True  True   True    True
5        True  True  False    True
6        True  True   True    True

In [149]:
data_from_csv19.notnull().sum().sum()

24

In [150]:
data_from_csv19['Marks'].isnull().sum()

2

In [151]:
data_from_csv19[data_from_csv19['Grades'].isnull()]

   Unnamed: 0     Name  Marks Grades
0           0  Priyang   98.0    NaN
3           3   Vedant   87.0    NaN

In [152]:
data_from_csv19[data_from_csv19['Grades'].notnull()]

   Unnamed: 0     Name  Marks         Grades
1           1   Aadhya    NaN             AB
2           2   Krisha   99.0             AA
4           4   Parshv   90.0             AC
5           5   Mittal    NaN             BA
6           6  Archana   82.0  not available

In [153]:

data_from_csv20 = pd.read_csv('Datasets/DS/data_m1.csv')
data_from_csv20

# data_from_csv20.drop(columns=['Unnamed: 0.1','Unnamed: 0'],inplace=True)
# data_from_csv20.to_csv('Datasets/DS/data_m1.csv')

   Unnamed: 0     Name      Marks         Grades
0           0  Priyang       98.0  not available
1           1   Aadhya        NaN             AB
2           2   Krisha       99.0             AA
3           3   Vedant       87.0            NaN
4           4   Parshv       90.0             AC
5           5   Mittal  na values             BA
6           6  Archana       82.0             BB
7           7      NaN        NaN  not avaliable

In [154]:
data_from_csv21 = pd.read_csv('Datasets/DS/data_m1.csv',na_values={'Grades':['not available','na values','not avaliable']},usecols=['Name','Marks','Grades'])
data_from_csv21

      Name      Marks Grades
0  Priyang       98.0    NaN
1   Aadhya        NaN     AB
2   Krisha       99.0     AA
3   Vedant       87.0    NaN
4   Parshv       90.0     AC
5   Mittal  na values     BA
6  Archana       82.0     BB
7      NaN        NaN    NaN

In [155]:
data_from_csv22 = pd.read_csv('Datasets/DS/data_#na.csv',na_values=['not available'],usecols=['Name','Marks','Grades'])
data_from_csv22

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0    NaN

### Na filter and keep default

In [156]:
data_from_csv23 = pd.read_csv('Datasets/DS/data_#na.csv',usecols=['Name','Marks','Grades'],keep_default_na=False)
data_from_csv23

      Name Marks         Grades
0  Priyang  98.0
1   Aadhya                   AB
2   Krisha  99.0             AA
3   Vedant  87.0
4   Parshv  90.0             AC
5   Mittal                   BA
6  Archana  82.0  not available

In [157]:
data_from_csv24 = pd.read_csv('Datasets/DS/data_#na.csv',usecols=['Name','Marks','Grades'],keep_default_na=True)
data_from_csv24

      Name  Marks         Grades
0  Priyang   98.0            NaN
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0  not available

### na_filter

use only when no null values to improve performance

In [158]:
data_from_csv25 = pd.read_csv(marks_csv,na_filter=False)
data_from_csv25

      Name  Marks Grades
0  Priyang     98     AA
1   Aadhya     89     AB
2   Krisha     99     AA
3   Vedant     87     AB
4   Parshv     90     AC
5   Mittal     83     BA
6  Archana     82     BB

### Dropna

data.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
---------------------------------------------------
1. Do you want to drop rows or columns having missing values? 
-  0, or 'index' : Drop rows which contain missing values.
-  1, or 'columns' : Drop columns which contain missing value.
---------------------------------------------------
data.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

2. Do you want to drop rows or columns having at least one missing value or all missing values? 

- 'any' : If any NA values are present, drop that row or column.
-  'all' : If all values are NA, drop that row or column.
---------------------------------------------------
data.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

3. Do you want to set some threshold value to drop missing values? 

- thresh : int, optional
    Require that many non-NA values.
---------------------------------------------------
data.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

4. Do you want to drop rows of some selected columns only? 

subset:  Define in which column(s) to look for missing values.
------------------------------------------------
data.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

5. Do you want to drop rows or columns temporarily or permanently?

- inplace : bool, default False
    If True, do operation inplace and return None.

In [159]:
data_from_csv26 = pd.read_csv('Datasets/DS/data_m.csv')
data_from_csv26

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB
7      NaN    NaN    NaN

In [160]:
data_from_csv26.dropna(axis=0,how='any')
### or #### both are same
data_from_csv26.dropna(axis='index',how='any')

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

In [161]:
data_from_csv26.dropna(axis=1,how='any')
### or #### both are same
data_from_csv26.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [162]:
data_from_csv26.dropna(axis=0,how='all')
### or #### both are same
data_from_csv26.dropna(axis='index',how='all')

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [163]:
data_from_csv26.dropna(axis=1,how='all')
### or #### both are same
data_from_csv26.dropna(axis='columns',how='all')

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB
7      NaN    NaN    NaN

In [164]:
data_from_csv26.dropna(axis=0,thresh=2)
### or #### both are same
data_from_csv26.dropna(axis='index',thresh=2)

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB

In [165]:
data_from_csv26.dropna(subset=['Marks','Grades'])

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

In [166]:
data_from_csv27 = data_from_csv26.dropna(inplace=False)

In [167]:
data_from_csv26

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB
7      NaN    NaN    NaN

In [168]:
data_from_csv27

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

In [169]:
data_from_csv26.dropna(inplace=True)
data_from_csv26

      Name  Marks Grades
2   Krisha   99.0     AA
4   Parshv   90.0     AC
6  Archana   82.0     BB

DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)
--------------------------------------------
value: 
- It is a value that is used to fill the null values.
-  scalar, dict, Series, or DataFrame.
------------------------------------------------
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)
----------------------------------------------
Method:

Method to use for filling holes in reindexed Series.
- pad / ffill: propagate last valid observation forward to next.
(Top To Bottom) 
- backfill / bfill: use next valid observation to fill gap.
(Bottom To Top)
-------------------------------------------------
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)

axis: 
- axis takes int or string value for - rows: Input can be 0 or  index. 
- Columns: Input can be 1 or  
columns. 
------------------------------------------------
inplace: It is a boolean which makes the changes in the data frame itself if True.
-----------------------------------------------
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)

limit:    int, default None

- If the method is specified, this is the maximum number of consecutive NaN values to forward/backward fill.
- Must be greater than 0 if not None.
---------------------------------------------
downcast : 

- It takes a dict or the string infer.
- which specifies what dtype to downcast to which one. Like Float64 to int64.

In [170]:
data_from_csv28 = pd.read_csv('Datasets/DS/data_m.csv')
data_from_csv28

      Name  Marks Grades
0  Priyang   98.0    NaN
1   Aadhya    NaN     AB
2   Krisha   99.0     AA
3   Vedant   87.0    NaN
4   Parshv   90.0     AC
5   Mittal    NaN     BA
6  Archana   82.0     BB
7      NaN    NaN    NaN

In [171]:
data_from_csv28.fillna(0)

      Name  Marks Grades
0  Priyang   98.0      0
1   Aadhya    0.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0      0
4   Parshv   90.0     AC
5   Mittal    0.0     BA
6  Archana   82.0     BB
7        0    0.0      0

In [172]:
data_from_csv29 = pd.read_csv('Datasets/DS/data_new.csv',usecols=['City','Temp'])

data_from_csv29.fillna(data_from_csv29['Temp'].mean())

  City       Temp
0  Ahm  34.000000
1  And  41.333333
2  Bar  41.333333
3  Sur  40.000000
4  Del  41.333333
5  Ban  50.000000

In [173]:
data_from_csv29 = pd.read_csv('Datasets/DS/data_m.csv')

data_from_csv29.fillna({'Marks':97,'Grades':'AA'})

      Name  Marks Grades
0  Priyang   98.0     AA
1   Aadhya   97.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AA
4   Parshv   90.0     AC
5   Mittal   97.0     BA
6  Archana   82.0     BB
7      NaN   97.0     AA

In [174]:
data_from_csv30 = pd.read_csv('Datasets/DS/data_new.csv',usecols=['City','Temp'])
data_from_csv30.fillna(method= 'pad')
### or ### both are same
data_from_csv30.fillna(method= 'ffill')

  City  Temp
0  Ahm  34.0
1  And  34.0
2  Bar  34.0
3  Sur  40.0
4  Del  40.0
5  Ban  50.0

In [175]:
data_from_csv31 = pd.read_csv('Datasets/DS/data_new.csv',usecols=['City','Temp'])
data_from_csv31.fillna(method= 'backfill')
### or ### both are same
data_from_csv31.fillna(method= 'bfill')

  City  Temp
0  Ahm  34.0
1  And  40.0
2  Bar  40.0
3  Sur  40.0
4  Del  50.0
5  Ban  50.0

In [176]:
data_from_csv32 = pd.read_csv('Datasets/DS/data_new.csv',usecols=['City','Temp'])

In [177]:
data_from_csv32.fillna(method= 'ffill',axis=0)
### or ### both are same
data_from_csv32.fillna(method= 'ffill',axis='index')

  City  Temp
0  Ahm  34.0
1  And  34.0
2  Bar  34.0
3  Sur  40.0
4  Del  40.0
5  Ban  50.0

In [178]:
data_from_csv32.fillna(method= 'ffill',axis=1)
### or ### both are same
data_from_csv32.fillna(method= 'ffill',axis='columns')

  City  Temp
0  Ahm  34.0
1  And   And
2  Bar   Bar
3  Sur  40.0
4  Del   Del
5  Ban  50.0

In [179]:
data_from_csv33 = pd.read_csv('Datasets/DS/data_m.csv')
data_from_csv33.fillna(method= 'bfill',axis=0)

      Name  Marks Grades
0  Priyang   98.0     AB
1   Aadhya   99.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     AC
4   Parshv   90.0     AC
5   Mittal   82.0     BA
6  Archana   82.0     BB
7      NaN    NaN    NaN

In [180]:
data_from_csv33.fillna(method= 'bfill',axis='columns')

      Name Marks Grades
0  Priyang  98.0    NaN
1   Aadhya    AB     AB
2   Krisha  99.0     AA
3   Vedant  87.0    NaN
4   Parshv  90.0     AC
5   Mittal    BA     BA
6  Archana  82.0     BB
7      NaN   NaN    NaN

In [181]:
data_from_csv33.fillna(method= 'ffill',axis='columns')

      Name   Marks Grades
0  Priyang    98.0   98.0
1   Aadhya  Aadhya     AB
2   Krisha    99.0     AA
3   Vedant    87.0   87.0
4   Parshv    90.0     AC
5   Mittal  Mittal     BA
6  Archana    82.0     BB
7      NaN     NaN    NaN

In [182]:
data_from_csv34 = pd.read_csv('Datasets/DS/data_new.csv',usecols=['City','Temp'])
data_from_csv34.fillna(method='ffill',limit=2)

  City  Temp
0  Ahm  34.0
1  And  34.0
2  Bar  34.0
3  Sur  40.0
4  Del  40.0
5  Ban  50.0

In [183]:
down_cast_df = pd.DataFrame({'a':[1,None]})
down_cast_df

     a
0  1.0
1  NaN

In [184]:
down_cast_df1 = down_cast_df.fillna(0,downcast='infer')
down_cast_df1

   a
0  1
1  0

Replace values given in 'to_replace' with 'value'.
---------------------------------------------
data.replace(
    to_replace=None,
    value=None,
    inplace=False,
    limit=None,
    regex=False,
    method='pad',
)
---------------------------------------------
- to_replace 
str, regex, list, dict, Series, int, float, or None
    How to find the values that will be replaced.
---------------------------------------------
- value 
scalar, dict, list, str, regex, default None
    Value to replace any values matching `to_replace` with.
---------------------------------------------
inplace : bool, default False
---------------------------------------------
limit : int, default None
    Maximum size gap to forward or backward fill.
---------------------------------------------
regex : 
bool or same types as `to_replace`, default False
Whether to interpret `to_replace` and/or `value` as regular expressions. 
---------------------------------------------
method : {'pad', 'ffill', 'bfill', `None`}
The method to use when for replacement.
---------------------------------------------
iat:
Access a single value for a row/column pair by integer position.

Similar to 'iloc', in that both provide integer-based lookups. Use
'iat' if you only need to get or set a single value in a DataFrame
or Series.
---------------------------------------------
at:
Access a single value for a row/column label pair.
---------------------------------------------
DataFrame.loc : Access a group of rows and columns by label(s).
--------------------------------------------
DataFrame.iloc : Access a group of rows and columns by integer position(s).

In [186]:
data_from_csv35 = pd.read_csv('Datasets/DS/data_#na.csv',usecols=['Name','Marks','Grades'])
data_from_csv35

      Name  Marks         Grades
0  Priyang   98.0            NaN
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0  not available

In [188]:
data_from_csv35.replace(to_replace='Priyang',value='Anil')

      Name  Marks         Grades
0     Anil   98.0            NaN
1   Aadhya    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0  not available

In [189]:
data_from_csv35.replace(to_replace=['Priyang','Aadhya'],value='Anil')

      Name  Marks         Grades
0     Anil   98.0            NaN
1     Anil    NaN             AB
2   Krisha   99.0             AA
3   Vedant   87.0            NaN
4   Parshv   90.0             AC
5   Mittal    NaN             BA
6  Archana   82.0  not available

In [190]:
data_from_csv35.replace(to_replace=np.nan,value='Anil')

      Name Marks         Grades
0  Priyang  98.0           Anil
1   Aadhya  Anil             AB
2   Krisha  99.0             AA
3   Vedant  87.0           Anil
4   Parshv  90.0             AC
5   Mittal  Anil             BA
6  Archana  82.0  not available

In [196]:
data_from_csv35.replace({'Marks':{np.nan:40},
                         'Grades':{np.nan:'FF'}})

      Name  Marks         Grades
0  Priyang   98.0             FF
1   Aadhya   40.0             AB
2   Krisha   99.0             AA
3   Vedant   87.0             FF
4   Parshv   90.0             AC
5   Mittal   40.0             BA
6  Archana   82.0  not available

In [204]:
data_from_csv35.replace({'Grades':[np.nan,-99,'not available']},'FF',inplace=True)

In [205]:
data_from_csv35.replace(['FF','AB','AA','BA'],['FAIL','VERY GOOD','EXCELLENT','GOOD'])

      Name  Marks     Grades
0  Priyang   98.0       FAIL
1   Aadhya    NaN  VERY GOOD
2   Krisha   99.0  EXCELLENT
3   Vedant   87.0       FAIL
4   Parshv   90.0         AC
5   Mittal    NaN       GOOD
6  Archana   82.0       FAIL

In [206]:
data_from_csv35.replace(to_replace=np.nan,method='ffill')

      Name  Marks Grades
0  Priyang   98.0     FF
1   Aadhya   98.0     AB
2   Krisha   99.0     AA
3   Vedant   87.0     FF
4   Parshv   90.0     AC
5   Mittal   90.0     BA
6  Archana   82.0     FF

### Interpolate bhe null values ko fill karne me kaam atta hai vo padh liya hai likhna baki hai

### Group BY

In [208]:
dict_for_gby = {'City': ['Ahmedabad','Baroda','Anand','Ahmedabad','Baroda','Anand'],
    'Temp':[40,35,32,45,37,34]}
df_for_gby = pd.DataFrame(dict_for_gby)
df_for_gby

        City  Temp
0  Ahmedabad    40
1     Baroda    35
2      Anand    32
3  Ahmedabad    45
4     Baroda    37
5      Anand    34

In [213]:
grp_a = df_for_gby[df_for_gby['City']=='Ahmedabad']
grp_a

        City  Temp
0  Ahmedabad    40
3  Ahmedabad    45

In [215]:
grp_b = df_for_gby[df_for_gby['City']=='Baroda']
grp_b

     City  Temp
1  Baroda    35
4  Baroda    37

In [214]:
grp_c = df_for_gby[df_for_gby['City']=='Anand']
grp_c

    City  Temp
2  Anand    32
5  Anand    34

In [216]:
avg_a = grp_a['Temp'].mean()
avg_b = grp_b['Temp'].mean()
avg_c = grp_c['Temp'].mean()

In [218]:
df_by_avg = pd.DataFrame({'City':['Ahmedabad','Baroda','Anand'],'Temp':[avg_a, avg_b, avg_c]})
df_by_avg

        City  Temp
0  Ahmedabad  42.5
1     Baroda  36.0
2      Anand  33.0

In [220]:
df_by_grp = df_for_gby.groupby('City')['Temp'].mean()
df_for_gby

        City  Temp
0  Ahmedabad    40
1     Baroda    35
2      Anand    32
3  Ahmedabad    45
4     Baroda    37
5      Anand    34

In [222]:
dict_for_gby1 = {'City': ['Ahmedabad','Baroda','Anand',
              'Ahmedabad','Baroda','Anand'],
    'Temp':[40,35,32,45,37,34],
    'Humidity':[32,34,23,24,27,32]}
df_for_gby1 = pd.DataFrame(dict_for_gby1)
df_for_gby1

        City  Temp  Humidity
0  Ahmedabad    40        32
1     Baroda    35        34
2      Anand    32        23
3  Ahmedabad    45        24
4     Baroda    37        27
5      Anand    34        32

In [223]:
df_for_gby1['Temp'].mean()

37.166666666666664

In [224]:
df_for_gby1.groupby('City')['Temp'].mean()

City
Ahmedabad    42.5
Anand        33.0
Baroda       36.0
Name: Temp, dtype: float64

In [229]:
grp1 = df_for_gby1.groupby('City')
for key,value in grp1:
    print(key)
    print(value)

Ahmedabad
        City  Temp  Humidity
0  Ahmedabad    40        32
3  Ahmedabad    45        24
Anand
    City  Temp  Humidity
2  Anand    32        23
5  Anand    34        32
Baroda
     City  Temp  Humidity
1  Baroda    35        34
4  Baroda    37        27

In [230]:
grp1.groups

{'Ahmedabad': [0, 3], 'Anand': [2, 5], 'Baroda': [1, 4]}

In [232]:
grp1.first()

           Temp  Humidity
City
Ahmedabad    40        32
Anand        32        23
Baroda       35        34

In [233]:
grp1.last()

           Temp  Humidity
City
Ahmedabad    45        24
Anand        34        32
Baroda       37        27

In [234]:
grp1.size()

City
Ahmedabad    2
Anand        2
Baroda       2
dtype: int64

In [235]:
grp1.get_group('Anand')

    City  Temp  Humidity
2  Anand    32        23
5  Anand    34        32

In [236]:
grp1.min()

           Temp  Humidity
City
Ahmedabad    40        24
Anand        32        23
Baroda       35        27

In [237]:
grp1.mean()

           Temp  Humidity
City
Ahmedabad  42.5      28.0
Anand      33.0      27.5
Baroda     36.0      30.5

In [241]:
grp1['Temp'].mean().add_prefix('avg_temp')

City
avg_tempAhmedabad    42.5
avg_tempAnand        33.0
avg_tempBaroda       36.0
Name: Temp, dtype: float64

In [242]:
grp1.describe()

           Temp                                                 Humidity  \
          count  mean       std   min    25%   50%    75%   max    count
City
Ahmedabad   2.0  42.5  3.535534  40.0  41.25  42.5  43.75  45.0      2.0
Anand       2.0  33.0  1.414214  32.0  32.50  33.0  33.50  34.0      2.0
Baroda      2.0  36.0  1.414214  35.0  35.50  36.0  36.50  37.0      2.0


           mean       std   min    25%   50%    75%   max
City
Ahmedabad  28.0  5.656854  24.0  26.00  28.0  30.00  32.0
Anand      27.5  6.363961  23.0  25.25  27.5  29.75  32.0
Baroda     30.5  4.949747  27.0  28.75  30.5  32.25  34.0

In [244]:
grp1['Temp'].agg(['min','max','mean'])

           min  max  mean
City
Ahmedabad   40   45  42.5
Anand       32   34  33.0
Baroda      35   37  36.0

In [245]:
def func(grp):
    return {'Min':grp.min(),'Mean':grp.mean()}

In [246]:
grp1.apply(func)

City
Ahmedabad    {'Min': [40, 24], 'Mean': [42.5, 28.0]}
Anand        {'Min': [32, 23], 'Mean': [33.0, 27.5]}
Baroda       {'Min': [35, 27], 'Mean': [36.0, 30.5]}
dtype: object

In [247]:
grp2 = df_for_gby1.groupby(['City','Temp'])
grp2

In [249]:
for key,value in grp2:
    print(key)
    print(value)

('Ahmedabad', 40)
        City  Temp  Humidity
0  Ahmedabad    40        32
('Ahmedabad', 45)
        City  Temp  Humidity
3  Ahmedabad    45        24
('Anand', 32)
    City  Temp  Humidity
2  Anand    32        23
('Anand', 34)
    City  Temp  Humidity
5  Anand    34        32
('Baroda', 35)
     City  Temp  Humidity
1  Baroda    35        34
('Baroda', 37)
     City  Temp  Humidity
4  Baroda    37        27

### Read HTML DF

In [17]:
url1 = 'https://en.wikipedia.org/wiki/List_of_cities_in_Gujarat_by_population'

In [20]:
web_df1 = pd.read_html(url1)
type(web_df1[0]),len(web_df1)

(pandas.core.frame.DataFrame, 2)

In [21]:
web_df1[0]

,Unnamed: 0,City,District,Area,Population (2021),Population (2011)
0,1.0,Ahmedabad,Ahmedabad,505.00,8253000,6357693
1,2.0,Surat,Surat,461.60,6936534,4645384
2,3.0,Vadodara,Vadodara,220.33,5240522,3022221
3,4.0,Rajkot,Rajkot,170.00,1934000,1390640
4,5.0,Bhavnagar,Bhavnagar,108.27,712000,605882
5,6.0,Jamnagar,Jamnagar,125.67,711000,600934
6,7.0,Gandhinagar,Gandhinagar,326.00,410323,206167
7,8.0,Junagadh,Junagadh,160.00,407000,319462
8,9.0,Gandhidham,Kutch,63.49,406000,247992
9,10.0,Anand,Anand,47.89,385291,288092
10,11.0,Navsari,Navsari,43.71,367322,292719
11,12.0,Morbi,Morbi,46.58,360001,251859
12,13.0,Nadiad,Kheda,45.16,330400,225071
13,14.0,Surendranagar,Surendranagar,58.60,298692,253606
14,15.0,Bharuch,Bharuch,43.80,288244,223647
15,16.0,Mehsana,Mehsana,31.76,257043,190753
16,17.0,Bhuj,Kutch,56.00,251489,219514
17,18.0,Porbandar,Porbandar,38.43,243584,217203
18,19.0,Palanpur,Banaskantha,39.50,242936,141532
19,20.0,Valsad,Valsad,24.10,231756,170060
20,21.0,Vapi,Valsad,22.44,230598,163630
21,22.0,Gondal,Rajkot,74.48,189797,173353
22,23.0,Veraval,Gir Somnath,39.95,185797,156696
23,24.0,Godhra,Panchmahal,20.16,173014,143644
24,25.0,Patan,Patan,17.82,171614,133744
25,26.0,Kalol,Gandhinagar,25.42,171395,133737
26,27.0,Dahod,Dahod,14.00,159326,130505
27,28.0,Botad,Botad,10.36,158985,130327
28,29.0,Amreli,Amreli,65.00,146014,117967
29,30.0,Deesa,Banaskantha,20.81,135869,111160
30,31.0,Jetpur,Rajkot,36.00,129653,118302

In [3]:
url2 = "https://en.wikipedia.org/wiki/List_of_banks_in_India"

In [4]:
web_df2 = pd.read_html(url2)[3]
web_df2

,Bank Name,Established,Headquarters,Branches,Total Assets,Revenues,Refs
0,Ujjivan Small Finance Bank,2017,"Bangalore, Karnataka",464.0,"9,473 crore (US$1.2billion)",NaN,NaN
1,Jana Small Finance Bank,2018,"Bangalore, Karnataka",718.0,NaN,NaN,[65]
2,Equitas Small Finance Bank,2016,"Chennai, Tamil Nadu",412.0,"1,787.41 crore (US$220million)",31.35 crore (US$3.9million),NaN
3,AU Small Finance Bank,2017,"Jaipur, Rajasthan",396.0,"2,155.25 crore (US$270million)",292 crore (US$37million),NaN
4,Capital Small Finance Bank,2016,"Jalandhar, Punjab",47.0,NaN,NaN,[66]
5,Fincare Small Finance Bank,2017,"Bangalore, Karnataka",919.0,NaN,NaN,[67]
6,ESAF Small Finance Bank,2017,"Thrissur, Kerala",575.0,NaN,475 crore (US$59million),[68]
7,North East Small Finance Bank,2017,"Guwahati, Assam",NaN,NaN,NaN,[69]
8,Suryoday Small Finance Bank,2017,"Navi Mumbai, Maharashtra",477.0,NaN,NaN,[70]
9,Utkarsh Small Finance Bank,2018,"Varanasi, Uttar Pradesh",NaN,NaN,NaN,[71]
10,Shivalik Small Finance Bank,2021,"Saharanpur, Uttar Pradesh",46.0,NaN,NaN,[72]
11,Unity Small Finance Bank,2021,NaN,NaN,NaN,NaN,[73]

### Merge Df

In [5]:
dict_m1 = {'key':['K0','k1','k2','k3','k4'],
        'Name':['Priyang','Aadhya','Vedant','Parshv','krisha']}
dict_m2={'key':['K0','k1','k2','k3','k4'],
      'Marks':[98,99,89,85,87]}

df_m1=pd.DataFrame(dict_m1)
df_m2=pd.DataFrame(dict_m2)

In [8]:
df_m1

  key     Name
0  K0  Priyang
1  k1   Aadhya
2  k2   Vedant
3  k3   Parshv
4  k4   krisha

In [7]:
df_m2

  key  Marks
0  K0     98
1  k1     99
2  k2     89
3  k3     85
4  k4     87

In [9]:
pd.merge(left=df_m1,right=df_m2,on='key')

  key     Name  Marks
0  K0  Priyang     98
1  k1   Aadhya     99
2  k2   Vedant     89
3  k3   Parshv     85
4  k4   krisha     87

In [11]:
dict_m3 = {'key1':['K0','k1','k2','k3','k4'],
         'key2':['K0','k1','k0','k1','k2'],
        'Name':['Priyang','Aadhya','Vedant','Parshv','krisha']}
dict_m4={'key1':['K0','k1','k2','k3','k4'],
       'key2':['K0','k1','k0','k1','k2'],
      'Marks':[98,99,89,85,87]}
df_m3=pd.DataFrame(dict_m3)
df_m4=pd.DataFrame(dict_m4)

In [12]:
pd.merge(df_m3,df_m4,on=['key1','key2'])

  key1 key2     Name  Marks
0   K0   K0  Priyang     98
1   k1   k1   Aadhya     99
2   k2   k0   Vedant     89
3   k3   k1   Parshv     85
4   k4   k2   krisha     87